// Console.Clear();

// Напишите программу, которая на вход принимает два числа и выдаёт, 
// какое число большее, а какое меньшее.
// a = 5; b = 7 -> max = 7
// a = 2 b = 10 -> max = 10
// a = -9 b = -3 -> max = -3

// Console.WriteLine("Chislo1");
// int numberA = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Chislo1");
// int numberB = Convert.ToInt32(Console.ReadLine());
// if(numberA > numberB)
// {
//     Console.WriteLine($"Первое число {numberA}, второе число {numberB}. Максимально число {numberA} ");
// }
// else{
//     Console.WriteLine($"Первое число {numberA}, второе число {numberB}. Максимально число {numberB} ");
// }

// Напишите программу, которая принимает на вход три числа 
// и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22

// Console.WriteLine("Chislo1");
// int numberA = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Chislo2");
// int numberB = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Chislo3");
// int numberC = Convert.ToInt32(Console.ReadLine());
// int max = 0;
// if(numberA > numberB)
// {
//     max = numberA;
// }
// else{
//     max = numberB;
// }
// if(max > numberC)
// {
//     max = max;
// }
// else{
//     max = numberC;
// }
// Console.WriteLine($"{numberA} {numberB} {numberC} -> {max}");

// Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).
// 4 -> да
// -3 -> нет
// 7 -> нет

// Console.WriteLine("Chislo1");
// int numberA = Convert.ToInt32(Console.ReadLine());
// if (numberA%2 == 0)
// {
//     Console.WriteLine($"{numberA} -> Да!");
// }
// else{
//     Console.WriteLine($"{numberA} -> Нет!");
// }

// Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

// Console.WriteLine("Напишите число");
// int number = Convert.ToInt32(Console.ReadLine()); 
// int n = 2;
// while (n < number)
// {
//     Console.Write(n + 2);
//     n = n + 2;
// }
// Console.Write($"{number} ->");

